import React from 'react';
import '../../src/assets/styles/Data.css';

function DataPage() {
  return (
    <div className='main-data-content'>
      <div className="data-page">
        <h1>数据部分</h1>
        <p>这里是数据部分的内容。</p>
        <p>这里是数据部分的内容。</p>
        <p>这里是数据部分的内容。</p>
        <p>这里是数据部分的内容。</p>
        <p>这里是数据部分的内容。</p>
        <p>这里是数据部分的内容。</p>
        <p>这里是数据部分的内容。</p>
        <p>这里是数据部分的内容。</p>
        <p>这里是数据部分的内容。</p>
        <p>这里是数据部分的内容。</p>
        <p>这里是数据部分的内容。</p>
        <p>这里是数据部分的内容。</p>
        <p>这里是数据部分的内容。</p>
        <p>这里是数据部分的内容。</p>
        <p>这里是数据部分的内容。</p>
        <p>这里是数据部分的内容。</p>
        <p>这里是数据部分的内容。</p>
        <p>这里是数据部分的内容。</p>
        <p>这里是数据部分的内容。</p>
        <p>这里是数据部分的内容。</p>
        <p>这里是数据部分的内容。</p>
        <p>这里是数据部分的内容。</p>
        <p>这里是数据部分的内容。</p>
        <p>这里是数据部分的内容。</p>
        <p>这里是数据部分的内容。</p>
        <p>这里是数据部分的内容。</p>
        <p>这里是数据部分的内容。</p>
        <p>这里是数据部分的内容。</p>
        <p>这里是数据部分的内容。</p>
        <p>这里是数据部分的内容。</p>
        <p>这里是数据部分的内容。</p>
        <p>这里是数据部分的内容。</p>
        <p>这里是数据部分的内容。</p>
        <p>这里是数据部分的内容。</p>
        <p>这里是数据部分的内容。</p>
        <p>这里是数据部分的内容。</p>
        <p>这里是数据部分的内容。</p>
        <p>这里是数据部分的内容。</p>
        <p>这里是数据部分的内容。</p>
        <p>这里是数据部分的内容。</p>
        <p>这里是数据部分的内容。</p>
        <p>这里是数据部分的内容。</p>
        <p>这里是数据部分的内容。</p>
        <p>这里是数据部分的内容。</p>
        <p>这里是数据部分的内容。</p>
        <p>这里是数据部分的内容。</p>
        <p>这里是数据部分的内容。</p>
        <p>这里是数据部分的内容。</p>
      </div>

    </div>

  );
}

export default DataPage;