-- 已经弃用，可供后续作为参考 2025.3.1
-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- 主机： 127.0.0.1:3306
-- 生成日期： 2025-01-27 15:01:40
-- 服务器版本： 8.3.0
-- PHP 版本： 8.2.18

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 数据库： `arknights_calculator`
--

-- --------------------------------------------------------

--
-- 表的结构 `classify_data`
--

DROP TABLE IF EXISTS `classify_data`;
CREATE TABLE IF NOT EXISTS `classify_data` (
  `id` int NOT NULL AUTO_INCREMENT,
  `item_id` varchar(255) NOT NULL,
  `item_name` varchar(255) NOT NULL,
  `item_value` int NOT NULL,
  `rarity` int NOT NULL,
  `type` varchar(255) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=104 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- 转存表中的数据 `classify_data`
--

INSERT INTO `classify_data` (`id`, `item_id`, `item_name`, `item_value`, `rarity`, `type`) VALUES
(1, '1-0-1-1', '精零1级基础作战记录', -61, 1, '升级'),
(2, '1-0-1-2', '精零1级初级作战记录', -125, 2, '升级'),
(3, '1-0-5-1', '精零5级基础作战记录', -69, 1, '升级'),
(4, '1-0-5-2', '精零5级初级作战记录', -141, 2, '升级'),
(5, '1-0-10-1', '精零10级基础作战记录', -79, 1, '升级'),
(6, '1-0-10-2', '精零10级初级作战记录', -159, 2, '升级'),
(7, '1-0-15-1', '精零15级基础作战记录', -88, 1, '升级'),
(8, '1-0-15-2', '精零15级初级作战记录', -177, 2, '升级'),
(9, '1-0-20-1', '精零20级基础作战记录', -122, 1, '升级'),
(10, '1-0-20-2', '精零20级初级作战记录', -251, 2, '升级'),
(11, '1-0-25-1', '精零25级基础作战记录', -162, 1, '升级'),
(12, '1-0-25-2', '精零25级初级作战记录', -324, 2, '升级'),
(13, '1-0-30-1', '精零30级基础作战记录', -202, 1, '升级'),
(14, '1-0-30-2', '精零30级初级作战记录', -404, 2, '升级'),
(15, '1-0-35-1', '精零35级基础作战记录', -242, 1, '升级'),
(16, '1-0-35-2', '精零35级初级作战记录', -484, 2, '升级'),
(17, '1-0-40-1', '精零40级基础作战记录', -282, 1, '升级'),
(18, '1-0-40-2', '精零40级初级作战记录', -564, 2, '升级'),
(19, '1-0-45-1', '精零45级基础作战记录', -322, 1, '升级'),
(20, '1-0-45-2', '精零45级初级作战记录', -644, 2, '升级'),
(21, '1-1-1-1', '精一1级基础作战记录', -81, 1, '升级'),
(22, '1-1-1-2', '精一1级初级作战记录', -165, 2, '升级'),
(23, '1-1-5-1', '精一5级基础作战记录', -89, 1, '升级'),
(24, '1-1-5-2', '精一5级初级作战记录', -179, 2, '升级'),
(25, '1-1-10-1', '精一10级基础作战记录', -100, 1, '升级'),
(26, '1-1-10-2', '精一10级初级作战记录', -199, 2, '升级'),
(27, '1-1-15-1', '精一15级基础作战记录', -111, 1, '升级'),
(28, '1-1-15-2', '精一15级初级作战记录', -222, 2, '升级'),
(29, '1-1-20-1', '精一20级基础作战记录', -122, 1, '升级'),
(30, '1-1-20-2', '精一20级初级作战记录', -244, 2, '升级'),
(31, '1-1-25-1', '精一25级基础作战记录', -133, 1, '升级'),
(32, '1-1-25-2', '精一25级初级作战记录', -265, 2, '升级'),
(33, '1-1-30-1', '精一30级基础作战记录', -144, 1, '升级'),
(34, '1-1-30-2', '精一30级初级作战记录', -288, 2, '升级'),
(35, '1-1-35-1', '精一35级基础作战记录', -155, 1, '升级'),
(36, '1-1-35-2', '精一35级初级作战记录', -310, 2, '升级'),
(37, '1-1-40-1', '精一40级基础作战记录', -166, 1, '升级'),
(38, '1-1-40-2', '精一40级初级作战记录', -332, 2, '升级'),
(39, '1-1-45-1', '精一45级基础作战记录', -177, 1, '升级'),
(40, '1-1-45-2', '精一45级初级作战记录', -354, 2, '升级'),
(41, '1-1-50-1', '精一50级基础作战记录', -188, 1, '升级'),
(42, '1-1-50-2', '精一50级初级作战记录', -376, 2, '升级'),
(43, '1-1-55-1', '精一55级基础作战记录', -199, 1, '升级'),
(44, '1-1-55-2', '精一55级初级作战记录', -398, 2, '升级'),
(45, '1-1-60-1', '精一60级基础作战记录', -210, 1, '升级'),
(46, '1-1-60-2', '精一60级初级作战记录', -420, 2, '升级'),
(47, '1-1-65-1', '精一65级基础作战记录', -221, 1, '升级'),
(48, '1-1-65-2', '精一65级初级作战记录', -442, 2, '升级'),
(49, '1-1-70-1', '精一70级基础作战记录', -232, 1, '升级'),
(50, '1-1-70-2', '精一70级初级作战记录', -464, 2, '升级'),
(51, '1-2-1-1', '精二1级基础作战记录', -80, 1, '升级'),
(52, '1-2-1-2', '精二1级初级作战记录', -162, 2, '升级'),
(53, '1-2-5-1', '精二5级基础作战记录', -87, 1, '升级'),
(54, '1-2-5-2', '精二5级初级作战记录', -175, 2, '升级'),
(55, '1-2-10-1', '精二10级基础作战记录', -96, 1, '升级'),
(56, '1-2-10-2', '精二10级初级作战记录', -192, 2, '升级'),
(57, '1-2-15-1', '精二15级基础作战记录', -105, 1, '升级'),
(58, '1-2-15-2', '精二15级初级作战记录', -210, 2, '升级'),
(59, '1-2-20-1', '精二20级基础作战记录', -114, 1, '升级'),
(60, '1-2-20-2', '精二20级初级作战记录', -228, 2, '升级'),
(61, '1-2-25-1', '精二25级基础作战记录', -123, 1, '升级'),
(62, '1-2-25-2', '精二25级初级作战记录', -246, 2, '升级'),
(63, '1-2-30-1', '精二30级基础作战记录', -132, 1, '升级'),
(64, '1-2-30-2', '精二30级初级作战记录', -264, 2, '升级'),
(65, '1-2-35-1', '精二35级基础作战记录', -141, 1, '升级'),
(66, '1-2-35-2', '精二35级初级作战记录', -282, 2, '升级'),
(67, '1-2-40-1', '精二40级基础作战记录', -150, 1, '升级'),
(68, '1-2-40-2', '精二40级初级作战记录', -300, 2, '升级'),
(69, '1-2-45-1', '精二45级基础作战记录', -159, 1, '升级'),
(70, '1-2-45-2', '精二45级初级作战记录', -318, 2, '升级'),
(71, '1-2-50-1', '精二50级基础作战记录', -168, 1, '升级'),
(72, '1-2-50-2', '精二50级初级作战记录', -336, 2, '升级'),
(73, '1-2-55-1', '精二55级基础作战记录', -177, 1, '升级'),
(74, '1-2-55-2', '精二55级初级作战记录', -354, 2, '升级'),
(75, '1-2-60-1', '精二60级基础作战记录', -186, 1, '升级'),
(76, '1-2-60-2', '精二60级初级作战记录', -372, 2, '升级'),
(77, '1-2-65-1', '精二65级基础作战记录', -195, 1, '升级'),
(78, '1-2-65-2', '精二65级初级作战记录', -390, 2, '升级'),
(79, '1-2-70-1', '精二70级基础作战记录', -204, 1, '升级'),
(80, '1-2-70-2', '精二70级初级作战记录', -408, 2, '升级'),
(81, '1-2-75-1', '精二75级基础作战记录', -213, 1, '升级'),
(82, '1-2-75-2', '精二75级初级作战记录', -426, 2, '升级'),
(83, '1-2-80-1', '精二80级基础作战记录', -223, 1, '升级'),
(84, '1-2-80-2', '精二80级初级作战记录', -445, 2, '升级'),
(85, '1-2-85-1', '精二85级基础作战记录', -234, 1, '升级'),
(86, '1-2-85-2', '精二85级初级作战记录', -467, 2, '升级'),
(87, '2-3-6', '三星通关6理智关卡', 72, 5, '三星'),
(88, '2-3-9', '三星通关9理智关卡', 108, 5, '三星'),
(89, '2-3-10', '三星通关10理智关卡', 120, 5, '三星'),
(90, '2-3-15', '三星通关15理智关卡', 180, 5, '三星'),
(91, '2-3-18', '三星通关18理智关卡', 216, 5, '三星'),
(92, '2-3-21', '三星通关21理智关卡', 252, 5, '三星'),
(93, '2-2-6', '二星通关6理智关卡', 60, 5, '二星'),
(94, '2-2-9', '二星通关9理智关卡', 90, 5, '二星'),
(95, '2-2-10', '二星通关10理智关卡', 100, 5, '二星'),
(96, '2-2-15', '二星通关15理智关卡', 150, 5, '二星'),
(97, '2-2-18', '二星通关18理智关卡', 180, 5, '二星'),
(98, '2-2-21', '二星通关21理智关卡', 210, 5, '二星'),
(99, '4-1', '活动商店使用1代币换取20龙门币', 20, 5, '活动商店'),
(100, '3-1', '基建加工站合成绿色材料', -100, 1, '材料合成'),
(101, '3-2', '基建加工站合成蓝色材料', -200, 2, '材料合成'),
(102, '3-3', '基建加工站合成紫色材料', -300, 3, '材料合成'),
(103, '3-4', '基建加工站合成橙色材料', -400, 4, '材料合成');
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
